# Напишите программу, которая на вход принимает 5 чисел
# и находит максимальное из них

nam1 = int(input())
nam2 = int(input())
nam3 = int(input())
nam4 = int(input())
nam5 = int(input())
max = nam1

if nam2 > max:
    max = nam2
if nam3 > max:
    max = nam3
if nam4 > max:
    max = nam4
if nam5 > max:
    max = nam5
print(max) 

